#include<stdio.h>
int main()
{
    int arr[] = { 10, 20, 30, 40, 50, 60 };
    int *ptr1 = arr;
    int *ptr2 = arr + 5;
    printf("%d\n", (*ptr2 - *ptr1));
    printf("%c", (char)(*ptr2 - *ptr1));
    return 0;
}

//کد مشکلی نداره ولی اگر بخوایم خط اخر کاراکتر چاپ کنه باید اینجوری بنویسیم
//علت اینکه در نسخه اصلی عدد چاپ می شود این است که ما کد اسکی را با کست کردن به کاراکتر خواهیم داشت و نه خود حرف را

// printf("%c", (*ptr2 - *ptr1) + 'a');

// خروجی حالت اصلی 
// 50 - 2 

// خروجی حالت فرعی
// 50 - p